alienate
estrangement
aloof
unsociable
withdrawn
solitude
solitary
recluse
hermit
hermitage
landmark
sequester
seclude
maroon
secede
cloistered
retiring
gregarious
outgoing
outrovert
introvert
conciliate
mollify
propitiate
pacify
placate
soothe
appease
defuse
assuage
console
solace
soften
sop
exasperate
chafe
nettle
bait
enrage
incense
inflame
enflame
infuriate
irritate
pique
disgruntle
miff
irk
acerbate
smart
fume
roil(rile)
turbid
sulk
gall
peeve
rankle
harass
molest
beleaguer
besiege
vex
trouble
grate
antagonize
disarm
assist
oblige
calumniate
slander
denigrate
defame
aspersion
malign
vilify
libel
detract
derogate
blacken
traduce
besmirch
abusive
libellous
calumnious
injurious
depreciate
belittle
look down on
make little of
disparage
play down
scorn
contempt
despise
slighting
pejorative
flout
persiflage
raillery
epithet
pariah
outcast
extol
exalt
laud
praise
commend
approbation
encomium
compliment
accolade
acclaim
eulogy
glorify
tout
rave
kudos
plaudit
magnify
hail
applaud
panegyric
paean
hymn
hymnology
hymnbook
anthem
tribute
exaggerate
overstate
vaunt
flaunt
brag
boast
brandish
splurge
sport
strut
swagger
bragger
boaster
braggart
braggadocio
windbag
blowhard
poseur
posturer
poser
posture
stance
highbrow
middlebrow
lowbrow
hyperbole
contrived
artifical
mannered
stilted
sincere
unaffected
cordial
confidence
self-assurance
aplomb
composure
equanimity
poise
counterbalance
homeostasis
staid
equipoise
equilibrium
fustian
bombastic
hyperbolic
flamboyant
grandiloquent
grandiose
pretentious
presumptuous
presumptive
ostentatious
pompous
turgid
pontificate
declaim
declamation
panache
execrate
loathe
detest
abhor
resent
sicken
animosity
animus
hatred
aversion
repugnance
dislike
distaste
disgust
disinclination
odium
loathing
rancor
enmity
antagonism
spleen
comity
adversary
opponent
antagonist
imprecate
anathema
abominate
curse
desecrate
blaspheme
sacrilege
sacrilegious
profane
blasphemous
plague
pestilential
loathsome
loath
abhorrent
irksome
averse
abominable
hateful
heinous
obnoxious
repugnant
odious
disgusting
rancorous
repellent
repulsive
execrable
distasteful
invidious
gusto
penchant
predilection
propensity
inclination
proclivity
liking
leaning
preference
predisposition
bent
flex
inflex
meddle
busybody
meddler
meddlesome
officious
antipathy
sibling
affinity
propinquity
kinship
kindred
strain
family
genus
species
genre
clan
lineage
descent
cult
proximal
generic
affection
affectation
adoration
camaraderie
affecting
court
woo
snub
affectionate
intimate
clique
embrace
cuddle
clasp
shrug
scowl
frown
kiss
peck
obliging
accommodating
dutiful
sublimate
ennoble
sublime
subliminal
noble
patrician
lofty
august
choice
aristocrat
patriciate
apex
acme
summit
zenith
vertex
culmination
climax
orgasm
apogee
pinnacle
steeple
nib
crest
culminate
clamber
tined
nadir
chasm
abyss
precipice
cliff
abyssal
abysmal
steep
precipitous
festinate
preponderance
preeminence
preempt
preponderant
prevailing
prevalent
predominant
prime
principal
overriding
preponderate
predominate
import
staple
stapler
surpass
exceed
outstrip
outshine
hurdle
surmount
prevail
outwit
transcend
hallowed
holy
sacred
saintly
saint
unholy
deity
deify
sanctify
consecrate
hallow
edify
didactic
desecrated
admire
lionize
dote
mollycoddle
cosset
pamper
coddle
fondle
caress
stroke
invigorate
strengthen
fortify
reinforce
consolidate
solidarity
enhance
valorize
vigor
vitality
vim
verve
strength
stamina
ginger
virility
sinew
tendon
aggravate
deteriorate
exacerbate
worsen
alleviate
mitigate
moderate
palliate
allay
abate
rebate
discount
deduct
subtract
surcharge
subdue
indomitable
invincible
execrate
desecrate
blaspheme
explain
expatiate
explicate
elucidate
elaborate
expound
illuminate
clarify
descant
rehearse
recital
relate
enunciate
articulate
particularize
exposition
exhibition
expository
pageant
enlighten
illuminate
demystify
obfuscate
confuse
confound
baffle
bewilder
befuddle
perplex
nonplus
fuddle
muddle
dilemma
quandary
predicament
predication
frustrate
bilk
foil
veneer
balk
baulk
baffle
impede
obstruct
thwart
stunt
retard
stall
forestall
stifle
stymie
hinder
hamper
encumber
cumber
disencumber
clog
stonewall
occlude
caulk
spackle
slot
seam
encumbrance
impediment
deterrent
obstacle
hurdle
utilize
harness
facilitate
quell
quash
squash
squelch
suppress
scotch
stifle
quench
curb
rein
bridle
tether
lasso
saddle
refrain
reprise
reiterate
latitude
footloose
franchise
enfranchise
disenfranchise
suffrage
suffragist
confiscate
expropriate
sequestrate
forfeit
forfeiture
fiscal
guillotine
pillory
fetter
pinion
indenture
shackle
manacle
leash
incarcerate
immure
imprison
detain
intern
bail
penitentiary
restrain
limit
confine
qualify
circumscribe
delimit
qualified
repress
oppress
inhibit
abstain
prohibit
proscribe
interdict
blockade
taboo
siege
ally
coalition
alliance
conjunction
confederation
confederacy
commonwealth
commune
communal
corporate
affiliate
associate
conjoin
aligned
affiliated
allied
concerted
cooperative
synergic
covenant
compact
pact
contract
bargain
treaty
infraction
blunder
breach
crack
contravene
mar
scathe
damnify
deface
rupture
demolish
demolition
overthrow
overturn
subvert
subversive
subversion
topple
devastate
ravage
undermine
undergird
dismantle
disassemble
disrupt
sabotage
saboteur
vandalism
smuggling
contraband
fawn
adulate
flatter
toady
ingratiate
cringe
cater
blandish
complaisance
adulation
subservience
obsequious
sycophantic
fawning
smarmy
unctuous
subservient
cringing
saccharine
saccharize
cyclamate
glucose
fulsome
sycophant
toady
snobbish
revile
fulminate
excoriate
censure
scold
berate
rate
upbraid
inveigh
braid
plait
strand
reprehend
reprove
reprimand
reproach
rebuke
reprobate
admonish
criticize
chide
chastise
castigate
denounce
decry
condemn
inflict
penalize
penance
pillory
flak
rail
deplore
vituperate
opprobrious
vituperative
scurrilous
slanderous
invective
obloquy
stricture
indignity
disgrace
dishonor
censorious
demanding
discredit
insult
stigmatize
affront
opprobrium
stigma
shame
swearword
cutting remark
critique
impeach
impugn
blamless
recourse
peroration
discourse
oration
orator
podium
rostrum
lectern
bench
tribunal
bar
elocution
diatribe
tirade
screed
harangue
elocute
filibuster
grandstand
bravura
spectator
arson
arsonist
incendiary
tinder
inferno
conflagration
deflagrate
blaze
sear
scorch
scathe
igneous
fiery
flammable
inflammable
combustible
nonflammable
incinerate
cremate
pyre
cinder
cinerary
causalgia
instigate
foment
incite
rouse
agitate
motivate
prompt
prod
goad
impel
propel
propulsion
evoke
elicit
gadfly
abet
suborn
abettor
demagogy
demagogue
accomplice
apprentice
apprehend
arrest
galvanic
galvanize
stimulate
stir up
spur on
urge on
engender
bring about
incur
lull
lullaby
cradlesong
integrate
amalgamate
coalesce
unify
mingle
commingle
intermingle
muddle
conflate
consolidate
incorporate
embody
externalize
materialzie
subsume
hodgepodge
hotchpotch
rabble
riffraff
confluence
concourse
junction
divergence
coagent
coagulant
hemostat
tourniquet
lint
bandage
styptic
stanch
stem
swathe
fuse
consolidate
hybrid
mongrel
purebred
medley
potpourri
pastiche
capriccio
concerto
compound
amalgam
element
zig
lineation
batch
zigzag
montage
mosaic
collage
image
arabesque
embroider
embroidery
sampler
stitch
clot
curdle
congeal
coagulate
curdle
agglomerate
conglomerate
condensation
liquefy
dew
solidify
dye
thinner
dilute
thin
polarize
disintegrate
dissociate
separate
segregate
isolate
sunder
sever
scission
abscission
incision
scissor
clipper
shear
clip
snip
brooch
centrifuge
asunder
cleave
partition
allocate
dispense
mete
metrical
quota
ration
ramify
bifurcate
trifurcate
ramification
dissolve
deliquesce
macerate
solvent
soluble
insoluble
melt
thaw
cut
gash
nick
wound
contusion
bruise
livid
sprain
graze
tear
avulse
rend
rive
lacerate
maul
riven
intact
heal
suture
pernicious
pertinent
penitent
pertinacious
perspicacious
perspicuous
impecunious
penurious
indigent
impoverished
destitute
needy
poverty
penury
wealthy
affluent
opulent
prosperous
palmy
promulgate
proclaim
claim
declare
announce
avow
assert
affirm
aver
contend
allege
allegation
predication
reaffirm
belabor
asseverate
manifesto
affidavit
oath
pledge
reality
verity
propagate
multiply
disseminate
disperse
scatter
strew
bruit
intersperse
publicize
advertise
circulate
circular
extirpate
eradicate
obliterate
extinguish
exterminate
remove
uproot
quench
preclude
obviate
slay
deracinate
annihilate
erasure
extinct
homicide
renaissance
revive
resurge
resurrect
resuscitate
rehabilitate
convalesce
recover
restore
recuperate
reconstitute
resurgent
irreparable
efface
flatten
emboss
bossy
blazon
shield
aegis
spear
shaft
tine
lance
lancet
scalpel
relegate
ostracize
banish
exile
expatriate
repatriate
deport
evict
expel
dispel
dislodge
oust
depose
depart
abscond
elope
emigrate
immigrate
exodus
influx
enlist
recruit
conscript
conscribe
impose
superimpose
draft
levy
tariff
substantiate
corroborate
verify
ascertain
attest
validate
confirm
affirm
authenticate
testify
aver
censor
instrumental
effectual
efficacious
telling
operative
unproductive
feckless
noncommittal
potentiate
invalidate
deactivate
nullify
hamstring
neutralize
evaluate
estimate
appraise
assess
audit
assay
truncate
curtail
abridge
abbreviate
acronym
ellipsis
apostrophe
colon
comma
caret
asterisk
hyphen
preposition
apogee
perigee
ellipse
oval
parabola
expunge
expurgate
retrench
elongate
prolong
protract
venerate
reverence
respect
deference
esteem
idolize
redoubtable
estimable
homage
obeisance
tribute
bow
nod
incentive
stimulus
hypnotize
spellbind
mesmerize
charm
attract
allure
inveigle
entice
seduce
ravish
arrest
entrance
enchant
enthrall
captivate
enrapture
ecstasy
intrigue
machination
machinery
pall
nail
spike
rivet
ravishing
riveting
arresting
intriguing
winsome
engaging
transporting
prepossessing
glamorous
jazzy
amorous
endearing
nubile
entrancing
enchanting
enrapturing
enthralling
mesmeric
absorbed
infatuated
enraptured
enamored
fascinated
gripping
compelling
obsessed
rapt
engrossed
intent
obsess
preoccupy
wallow
abstracted
bait
lure
frequent
resort to
haunt
phantom
change
mutate
root
recant
proselytize
proselyte
convert
prey
quarry
hunter
prowl
trail
bedraggled
sodden
soggy
sopping
humid
moist
dank
drenched
saturate
drench
bedraggle
soak
steep
sop
dampen
douse
immerse
dip
macerate
sponge
inundate
overwhelm
submerge
engulf
founder
sink
syringe
defuse
infuse
imbue
instill
inculcate
indoctrinate
implant
suffuse
permeate
pervade
teem
overflow
brim
brink
draw out
irrigate
fertilize
manure
fertilizer
compost
flush
blush
plush
drain
draining
tonic
marsh
swamp
bog
mire
puddle
lake
crater
pit
volcano
lava
geyser
gusher
prairie
savanna
sod
jungle
plantation
arboretum
orchard
arable
clover
tobacco
cactus
verdant
lush
luxuriant
exuberant
prolific
fecund
fruitful
generative
genital
congenital
bud
shoot
spear
sprout
sprig
twig
scion
seedling
bulb
bulbous
knob
burgeon
sprout
germinate
flourish
germinal
fecundity
barren
sterile
aseptic
septic
rotten
sere
wither
blight
languish
shrivel
blast
sear
atrophy
trophy
deforest
fold
hem
pleat
pucker
ruffle
rumple
crumple
corrugate
ruga
crease
rugose
shrunken
wrinkled
puckery
wizened
fragile
frail
delicated
vulnerable
brittle
frailty
friable
spindly
vat
dye
tan
pestle
mortar
grind
tamp
mash
hash
pulpy
pulp
masticate
crumble
fracture
mince
granulate
pulverize
grate
mull
triturate
shatter
crush
juggernaut
siren
ostracon
shard
fragment
segment
segmentable
segmental
debris
detritus
gravel
abrade
chafe
scuff
shuffle
friction
attrition
wear
natality
mortality
casualty
toll
population
workforce
whet
sharpen
hone
whetstone
hone
flint stone
flinty
rhinestone
quartz
petrology
petrify
marble
alabaster
plaster
limestone
granite
graphite
grit
pebble
pele
cobble
boulder
monolithic
paleolith
neolith
shale
slate
quarry
prospect
mine
ore
mineral
lode
coal
soot
decrepitate
crepitate
well
aquifer
blunt
obtuse
hardness
firm
sturdy
hardy
sinewy
tendinous
brawny
burly
stocky
stout
stalwart
corroborant
roborant
stiff
stark
taut
flaccid
flabby
slack
spongy
lax
slacken
tauten
fasten
fixate
secure
anchor
splint
clinch
ensconce
settle
marshal
nestle
unsettled
sling
hinge
pivot
delicate
exquisite
refined
chic
meretrix
meretricious
gaudy
tawdry
garish
ornate
specious
trumpery
bauble
trinket
susceptible
vulnerable
impressionable
rectify
disabuse
reclaim
redress
revise
collate
proofreader
repair
mend
amend
emend
renovate
refurbish
anew
alter
distort
contort
deform
torsion
torque
lever
leverage
fulcrum
wrench
misrepresent
misinform
misperceive
garble
falsify
tamper
interpolate
interpose
interjection
tinker
paraphrase
verbatim
anagram
commentary
annotate
gloss
skim
browse
amass
accumulate
collect
gather
garner
congregate
throng
deposit
accrue
accrete
mushroom
alluvial
cumulus
inch
motility
mobility
stasis
stationary
stagnant
condone
pardon
forgive
magnanimous
tolerant
forbearing
forbearance
permissive
income
proceeds
endow
endue
bestow
donate
furnish
provide
purvey
proffer
offer
proposition
outlook
tender
render
rendering
deliver
transmit
transfer
entreat
beg
solicit
supplicate
beseech
implore
invoke
plead
appeal
appellant
petition
petitioner
supplicant
suppliant
exigency
urgency
emergency
authoratative
magisterial
imperious
imperative
imminent
impending
pending
exigent
emergent
urgent
proximate
pressing
stringent
deferable
glut
cloy
satiety
oversupply
surfeit
surplus
cloying
saccharine
melliferous
ravening
ravenous
greedy
grasping
avaricious
gluttonous
acquisitive
rapacious
insatiable
voracious
glutton
anorexia
edible
comestible
potable
habitable
imbibe
guzzle
gulp
quaff
swill
swig
booze
slurp
potation
carouse
sip
nip
champ
masticate
gorge
gobble
devour
nibble
vomit
disgorge
nausea
nauseate
excrete
secrete
incretion
swallow
ingest
assimilate
voidance
catharsis
purgation
purgatory
purge
cathartic
purgative
dizzy
woozy
giddy
vertigo
fast
greed
avarice
rapacity
cupidity
mercenary
venal
bourgeois
bribe
graft
defalcate
peculate
appropriate
embezzle
purloin
kleptomania
larceny
fund
usurp
seize
trespass
entrée
appropriation
appropriateness
coin
money
wealth
pelf
pecuniary
monetary
ledger
denominate
denomination
gallon
mint
strike
medal
imprint
stamp
impression
numismatist
philatelist
herpetologist
ichthyologist
ornithologist
anthropologist
astronomer
planet
asteroid
podiatrist
chiropodist
cardiologist
cougar
puma
panther
claw
talon
chameleon
hawk
hawker
huckster
peddler
hucklebacked
hunchbacked
eagle
falcon
owl
ostrich
finch
lark
canary
crow
magpie
phoenix
crowd
throng
flock
school
shoal
salmon
carp
minnow
roe
spawn
creel
soar
hover
flutter
perch
cohabit
bask
croak
frog
tadpole
caterpillar
butterfly
chrysalis
cocoon
larva
anthropoid
ape
lemur
primate
amphibian
pachyderm
carnivore
herbivore
folivore
omnivore
carnivorous
herbivorous
meterology
zoology
botany
ornithology
entomology
ecology
demography
ethnology
pathology
dermatology
podiatry
neurology
pediatrics
gerontology
kinematics
kinescope
kinetic
locomotion
linguistics
etymology
derivation
provenance
genesis
genetic
genetics
heredity
hereditary
philology
rhetoric
terminology
geometry
geometrician
geometer
chronology
misnomer
appellation
compellation
designation
denominate
calligraphy
orthography
acoustics
tonetics
acoustic
auditory
gastronomy
astronomy
observatory
astrology
astrolabe
pedagogy
pedagogic
pedantic
pedagogue
pedant
preceptor
mentor
tutor
agnostic
pagan
epistemology
epistemic
teleology
metaphysics
nihilism
nihil
phenomenology
seminary
theology
theologian
logistics
logic
logocentric
chemistry
alchemy
hermetic
tango
ballet
ballerina
minuet
pirouette
choreography
plot
screenplay
script
scenario
taxonomist
discography
musicology
conifer
cone
coniform
fern
gnarl
gnarled
pine
larch
maple
cypress
oaf
oak
acorn
aspen
palm
needle
frond
leaf
foliage
leafage
deciduous
defoliant
defoliator
herbicide
insecticide
pesticide
insect
cockroach
mosquito
termite
centipede
scorpion
spider
arachnid
arachnidan
diplopod
arthropod
hexapod
biped
vertebra
spine
vertebrate
invertebrate
specimen
stem
stalk
trunk
osseous
bony
ossiferous
ligneous
lignify
lignum
timber
timbre
lumber
fell
lumberjack
forestry
silviculture
horticulture
hortitherapy
mariculture
forestland
forest
bush
grove
glade
sapling
vine
liana
arbor
arboreal
laminate
veneer
baseboard
panel
triptych
splint
splinter
prune
plum
raisin
grape
limb
twig
resin
gum
rubber tree
bark
epidermis
cuticle
dermatitis
hyperderm
integument
rind
hull
husk
hulk
shell
topsoil
crust
membrane
pod
shuck
capsule
carapace
loaf
confection
aquatic
aqueous
fluvial
potamic
river
brook
creek
rivulet
enamel
biosphere
creature
mite
microorganism
microbe
pathogem
parasite
vermin
host
plankton
prokaryote/procaryoke
bacteria
germ
germule
germinate
german
maternal
embryo
scutellum
hormone
horme
enzyme
yeast
zymurgy
zymic
ferment
leaven
mushroom
fungi
mold
medium
dough
mammal
fauna
flora
caste
ethnic
ethic
desire
lust
hanker
aspire
crave
yearn
slaver
saliva
hankering
covet
pine
peak
gaunt
peaky
haggard
avid
longing
covetous
desperate
persecute
harass
molest
infest
badger
harry
nag
ambulate
perambulate
promenade
saunter
stroll
ramble
amble
wander
meander
slither
wiggle
waddle
dodder
totter
falter
hobble
hitch
limp
lame
cripple
teeter
stagger
stumble
lurch
scuff
swagger
strut
cavort
prance
gambol
stride
mince
slink
plod
trudge
creep
flounder
flatfish
lumber
lug
tug
carry
ford
glide
viaduct
surmise
speculation
guess
conjecture
hypothesis
thesis
cajole
coax
inveigle
wangle
wheedle
induce
blandishments
allurement
ruse
camouflage
masquerade
perjury
perjure
jury
testimony
deposition
depose
fabricate
forge
prefabricate
sham
fake
false
spurious
forged
counterfeit
bogus
synthetic
ersatz
dummy
genuine
authentic
authentic article
decoy
deceive
delude
gull
bilk
defraud
cozen
dupe
beguile
hoodwink
bamboozle
swindle
gouge
spoof
hoax
rig
monopoly
deceit
elective
ballot
gerrymander
constituency
constituent
constitute
construct
establish
constitution
voting
roll call
roster
roll
personnel
faculty
slate
candidate
candidature
candidacy
dupe
prevaricate
equivocate
fraud
knave
knavery
crook
swindler
hawk
fraudulent
mendacious
deceptive
delusive
hypocritical
hypocrisy
hypocrite
honest
veracious
truthful
tactless
probity
integrity
veracity
rightness
rectitude
uprightness
righteous
depraved
depravity
turpitude
vile
iniquity
obey
observance
transgress
overreach
presumption
presupposition
encroach
infringe
intrude
interlope
impinge
incursion
arrogate
assume
usurp
interloper
guileful
cunning
wily
artful
crafty
sly
insidious
archness
syllogism
sophistry
sophism
trickery
cunning
guile
chicanery
duplicity
artifice
subterfuge
pretext
stein
chalice
goblet
consecrated cup
flask
carafe
ewer
pitcher
kettle
decanter
decant
glib
eloquent
manipulative
credence
belief
accredit
delegate
delegation
empower
entitle
gullible
credulous
receptive
exorable
skeptic
doubtful
distrustful
suspicious
leery
dubious
paranoid
paranoia
monomania
tentative
temporary
provisional
provisory
conditional
interim
transitional
interlude
intermission
intermittent
definitive
pronounced
probationary
hesitant
vacillatory
vacillating
uncertain
assertive
dogmatic
pontifical
dogmatist
liberalist
plausible
feasible
viable
verisimilar
defeasible
indefeasible
credible
believable
commitment
convict
culprit
criminal
felon
felony
conviction
certitude
gratify
suffice
slake
quench
satiate
sate
tantalize
content
satisfaction
gratification
disaffected
discontent
disgruntled
win over
naïve
guileless
ingenuous
artless
forthright
pristine
pure
cherubic
seraphic
fiendish
tactless
purist
misanthrope
ingenue
cynic
cynical
worldly
sophisticated
mundane
earthly
secular
temporal
tempor
founded
grounded
aloft
star
constellation
galaxy
cosmos
ether
galactic
sidereal
stellar
astral
interstellar
empyreal
ethereal
celestial
cosmic
celeste
spiritual
pretender
imposter/impostor
imposture
charlatan
mountebank
quack
coward
dastard
craven
poltroon
recreant
faintheart
threaten
daunt
cow
intimidate
menace
bully
browbeat
tyrannize
hector
minatory
minatorial
appall
frighten
faze
apparition
phantom
specter
spectral
spook
revenant
extort
extortionist
ransack
ransom
compel
compelling
compulsion
duress
subdue
subjugate
conquer
quell
vanguish
overcome
overmaster
resubject
conquest
pusillanimous
craven
fainthearted
cowed
timorous
timid
fearful
trepid
tremulous
spineless
diffident
timid
unassertive
shamefaced
caretaker
concerned
solicitous
solicitude
suspense
burdensome
careworn
obsessed
apprehensive
terrible
horrible
horrific
horrid
ghastly
grisly
gruesome
appalling
lurid
formidable
dire
dreadful
macabre
eerie
hideous
ugly
homely
dread
pulchritude
dismay
aghast
shocked
startled
appalled
astonished
astounded
consternation
quail
quiver
quaver
tremble
shudder
cower
flinch
draw back
cringe
recoil
wince
boggle
goggle
courage
valor
mettle
pluck
spunk
grit
prowess
prow
bow
stern
bravado
embolden
hearten
nerve
stouthearted
brave
courageous
daring
bold
fearless
plucky
heroic
gallant
valiant
valorous
mettlesome
gutsy
intrepid
foolhardy
daredevil
nervy
decorum
propriety
etiquette
bearing
protocol
prescribe
stipulate
insolent
rude
flip
vulgar
loutish
boorish
churlish
indecorous
ill-bred
asperity
hardship
crass
earthy
down-to-earth
gross
summation
scurrilous
ribald
scurvy
despicable
ignominious
nasty
ignoble
vile
ungainly
ham-handed
uncouth
churl
peasant
adventurous
venturous
rash
impudent
brazen
temerarious
audacious
reckless
forward
brash
brassy
shameless
impertinent
insolent
barefaced
temerity
hardimood
cursory
headlong
slapdash
summary
precipitate
harebrained
hasty
brusque
coarse
roughen
precursory
pioneering
sequel
malapropism
verbal
effrontery
gaffe
suavity
civility
comity
harmony
rapport
goodwill
rapprochement
concord
amity
reconciliation
reunite
genteel
urbane
polite
polished
courteous
decorous
seemly
suave
debonair
prim
demure
decent
prudish
priggish
gentry
belligerent
bellicose
pugnacious
combative
militant
aggressive
warlike
scrappy
combatant
warmonger
avenge
revenge
retaliate
reprisal
vengeance
vindictive
retaliatory
vengeful
nemesis
martial
maneuver
manoeuvre
outmaneuver
jockey
pugilism
boxing
pugilist
boxer
blow
punch
attack
scuffle
assail
inroad
raid
assault
batter
sock
spank
question
heckle
grill
broil
postulate
posit
presume
conjecture
speculate
extrapolate
predict
presage
foreshadow
forebode
bode
soothsay
soothsayer
harbinger
augur
oracle
prophecy
omen
augury
bodement
forerunner
premonition
threat
divine
auspice
portent
portend
herald
unheralded
prescience
divination
foreknowledge
predestine
predestination
foresight
forethought
myopia
intuition
instinct
hunch
intuit
legerdemain
legerity
sleight
sleigh
stunt
sorcery
sorcerer
necromancy
incantation
apocalypse
presicent
prophetic
delphian
fatidic
mantic
oracular
sibylline
vatic
vaticinal
auspicious
propitious
boding well
fortuitous
favorable
toward
lucky
providential
ominous
boding (ill)
untoward
ill-omened
portentous
far-reaching
sinister
apocalyptic
hapless
untoward
calamitous
mishap
disaster
misfortune
catastrophe
cataclysm
calamity
havoc
holocaust
carnage
slaughter
butcher
decimate
tumult
turmoil
riot
hubbub
welter
commotion
hurly-burly
ferment
squall
pandemonium
rioter
hodgepodge
hotchpotch
pell-mell
topsy-turvy
wreckage
shambles
boon
benediction
benison
blessing
rogation
invocation
rescue
save
succor
salvage
restore
lout
boor
barbarian
killjoy
philistine
aesthete
artistry
craft
trade
carpentry
occupation
sculptor
sculpt
carve
engrave
chase
etch
etching
inscribe
gouge
chip
hew
hack
hackle
cameo
relief
gem
sapphire
lapidary
trinket
crayon
pastel
sculpture
chisel
stylus
pedal
pedestal
plinth
statuary
statue
stance
stature
figure
figurine
statuette
bust
colossus
mendicant
beggar
pauper
beg
cadge
neophyte
novice
tyro
roookie
beginner
tenderfoot
oaf
dullard
dolt
simpleton
imbecile
moron
idiot
loon
lunatic
stupid
silly
daft
oafish
foolish
witless
fatuous
imbecile
harebrained
vacuous
inane
void
vacant
fluffy
hollow
tenuous
pointless
nil
childish
puerile
sophomoric
jejune
folly
imbecility
bungle
fumble
grope
stultify
awkward
clumsy
gaucherie
gauche
bungling
bumbling
inept
heavy-handed
ungainly
elephantine
half-baked
mechanical
sapient
sage
sagacious
judicious
witty
wise
tact
tactful
shrewd
agile
canny
nimble
calculating
hardheaded
astute
canny
shifty
politic
diplomatic
perspicacious
ingenious
inventive
ingenuity
keen
acute
acumen
savvy
clairaudience
clairvoyance
insightful
perspective
responsive
prompt
swift
expeditious
meteoric
dispatch
accelerate
expedite
hasten
hie
hustle
jostle
shove
scurry
scamper
scud
check
contain
containment
alacrity
celerity
legerity
aptitude
talent
flair
serendipitous
heed
heedful
mindful
advertent
attentive
cognizant
aware
wary
vigilant
alert
watchful
intentional
calculated
heedless
remiss
negligent
delinquent
derelict
oblivious
oblivion
lax
inadvertent
incognizant
unreflective
mnemonic
mnemonist
amnesia
rote
sluggard
indolence
sloth
laziness
lethargic
drowsy
slumber
slumberous
somnolent
somniferous
sleepy
soporous
hypnotic
soporific
hypnotize
insomnia
trance
supine
prone
shiftless
shift
makeshift
shifty
expediency
expedient
moratorium
moratory
overdue
layover
stopover
shelve
table
reprieve
respite
respire
exhale
inhale
perspire
sudorific
sudation
asthma
abeyance
stalemate
deadlock
standstill
impasse
interim
suspend
fossilize
fossify
ossify
calcify
indurate
halt
cease
cessation
stammer
stutter
hem
halting
procrastinate
delay
defer
lag
temporize
tarry
lengthen
protract
prolong
dilatory
tardy
tardigrade
sluggish
laggard
belated
obtuse
insensitive
insensate
insentient
torpid
inert
exert
reactant
reagent
recipient
dormant
inactive
fallow
repose
rest
hibernate
sentient
conscious
sensitive
sensible
sensational
sensation
sensitivity
sensitization
puissant
powerful
potent
omnipotent
almighty
all-powerful
mighty
omnifaceted
clout
authority
mace
regime
regimen
throne
royalty
levy
coronation
crown
inaugurate
install
induct
instate
confer
matriculate
hire
discharge
tenure
commence
onset
outset
embark
commencement
inception
truant
absenteeism
incumbent
abdicate
divest
autocrat
dictator
authoritarian
totalitarian
tyrant
despot
imperator
potentate
ruler
subject
sovereign
imperial
despotic
dictatorial
arbitrary
bossy
sovereignty
ascendance
ascendancy
hegemony
reign
realm
territory
domain
dominion
supremacy
autonomy
charter
prerogative
previlege
monarch
monarchy
republic
feudal
bureaucracy
plutocracy
gerontocracy
theocracy
oligarchy
dominate
wield
brandish
flourish
sway
domineering
other-directed
soldier
sentinel
sentry
lookout
infantry
militia
jockey
cavalier
cavalry
cavalcade
chivalry
chivalrous
horsemanship
equitation
bodyguard
retainer
attendant
attache
retinue
safeguard
harridan
witch
coven
coterie
cottage
clique
insider
suite
room
staff
officer
leader
bellwether
rudder
steer
charismatic
precursor
forerunner
vanguard
pioneer
harbinger
sibyl
herald
adherent
rear
ensuing
subsequent
prior
former
anterior
precede
antedate
precedent
precedence
priority
revert
humiliate
mortify
embroil
entangle
enmesh
pester
plague
snarl
intervene
twine
intertwine
interweave
snare
seine
gin
ensnare
disenchant
disillusion
disembarrass
disengage
emancipate
manumit
extricate
disentangle
untangle
unravel
ravel
tangle
accept
accede
concur
assent
consent
espouse
betroth
marital
connubial
conjugal
nubile
nubility
monogamy
spouse
consort
dissent
countenance
endorse
champion
uphold
support
buoy
bolster
sanction
license
licensure
ratify
warrant
vouch
voucher
guarantee
hallmark
practice
practitioner
cushion
mattress
pillow
four-poster
gibe
jibe
jeer
jape
deride
sneer
tease
tantalize
taunt
mock
scoff
jocular
jocose
joking
jesting
facetious
facet
badinage
banter
prank
prankster
punch-line
bantering
playful
waggish
hilarious
ludicrous
risible
droll
nonsensical
ridiculous
unreasonable
preposterous
absurd
grotesque
laugh
guffaw
chuckle
giggle
chortle
commonsensical
mischievous
brattish
impish
puckish
wanton
coltish
colt
archness
disciplined
miscreant
ruffian
rascal
rapscallion
villain
brat
imp
buffoon
wag
humorist
witticism
simulate
mimic
impersonate
parrot
charade
rebus
guise
dissimulate
dissemble
disguise
feign
feint
profess
gild
belie
mime
pantomime
play
histrionics
histrionic
theatrical
repertoire
repertory
travesty
parody
spoof
burlesque
farce
comedy
comedian
comedienne
diva
wordsmith
potboiler
hack
doggerel
quatrain
limerick
sonnet
lyric
madrigal
idyll
idyllic
ode
carol
verse
poem
poetry
anthology
article
prose
scripture
poet
bard
byline
movie
credits
anecdote
prosody
rhyme
rhythm
rhythmic
eurhythmic
arrhythmic
alliterate
scan
metric(al)
parse
grammatical
solecism
chapter
canto
stanza
strophe
movement
ragtime
oratorio
cantata
ditty
symphony
sonata
crescendo
crescent
lunula
plenilune
coda
finale
epilogue
denouement
terminus
ultimatum
termination
cloture
cello
viola
violin
baritone
mezzo
ensemble
entirety
choir
chorus
choral
dual
duet
quartet
chant
troupe
cast
recast
circus
sideshow
opera
operetta
libretto
overture
prelude
aria
solo
soliloquy
monolog(ue)
recital
recitalist
conductor
instrumentalist
percussionist
reed
reedy
baton
truncheon
tambour
tambourine
accompaniment
accompanist
orchestra
audition
auditorium
improvise
extemporize
ad-lib
extemporaneous
impromptu
offhand
recite
rite
motif
theme
thematic
substance
pith
gist
tenor
purport
purported
reputed
alleged
intent
effect
volume
issue
periodical
reportage
journalist
reportorial
episode
episodic
series
illustrator
caricaturist
caricature
melodrama
revue
skit
skittish
flighty
vignette
scence
satirist
essayist
lampoon
satire
sarcasm
quip
irony
ridicule
satirize
burlesque
spoof
wry
languid
lank
weak
feeble
enervated
effete
limp
flaggy
puny
infirm
infirmary
clinic
clinical
stethoscope
diagnosis
prognosis
listless
spiritless
lackadaisical
rejuvenate
decrepit
senile
senescent
senility
hoary
octogenarian
octennial
octopus
demise
perish
expire
obituary
mortuary
mortician
moribund
defunct
cane
crutch
staff
enervate
enfeeble
languish
weaken
debilitate
emaciate
waste away
drain away
macerate
debility
doldrums
equator
monsoon
meridian
postmeridian
headwind
tailwind
droop
sag
flag
cast down
wane
dwindle
diminish
pare
ebb
diminution
subside
descent
waft
plummet
slump
ascent
hike
proliferate
balloon
boom
surge
spawn
billowy
surging
upsurge
wax
energetic
vivacious
vigorous
lively
spirited
effervescent
bracing
racy
exuberant
thriving
lusty
robust
sturdy
hale
decrepit
anemic
morbid
pathological
morbific
prophylactic
sane
sanity
psyche
psychic
psychosis
psychoanalsis
psychoneurosis
psychopathic
psychotic
psychiatry
psychiatrist
psychology
hysteria
acrophobia
ail
disease
illness
ailment
aliment
alimentary
acupuncture
syndrome
remedy
cure
therapy
therapeutic
cultivate
nutrition
nutrient
nurture
nourish
foster
breed
incubate
brood
omelet
fawn
buck
cub
incubation
latency
latent
incubus
nightmare
concubine
sustenance
subsistence
upright
erect
recumbent
prostrate
slouch
lounge
loll
loaf
linger
loiter
tarry
dawdle
dally
trifle
lark
frolic
laze
sprawl
idle
travail
lounger
terrace
porch
foyer
lobby
lounge
leisureliness
tired
tiresome
exhausted
jaded
fatigued
wearisome
exhausting
grueling
jade
lassitude
weariness
fatigue
ennui
exhaust
deplete
indefatigable
arduous
laborious
taxing
strenuous
operose
onerous
burdensome
labored
assiduous
sedulous
diligent
industrious
studious
travail
toil
facile
foolproof
lucubration
endeavor
struggle
strive
painstaking
earnest
sinecure
unremitting
incessant
continuous
continual
sequential
restless
intermittent
remittent
staccato
remit
remittance
draft
papyrus
papyrology
membrane
parchment
remission
evade
eschew
shirk
skirt
shun
avoid
elude
ward off
parry
sidestep
avert
dodge
deflect
escapism
elusive
gloss over
flit
flirt
coquet
coquette
flirtatious
coy
malinger
goldbrick
inevitable
inevasible
ineluctable
unavoidable
requisite
prerequisite
premise
entail
release
loose
liberate
enfranchise
pillage
plunder
loot
snatch
despoil
rapine
rape
protest
remonstrate
demonstrate
adoptation
renounce
relinquish
abandon
abrogate
annul
forgo
forsake
waive
renege
negate
abnegate
disclaim
deny
gainsay
naysay
repudiate
disavow
abolish
abjure
spurn
rebuff
acknowledgement
desert
discard
jet
jettison
jetsam
procure
dune
oasis
rescind
retract
repeal
revoke
countermand
withdraw
ordinance
statute
statutory
decree
injunction
writ
fiat
code
codify
preamble
mortgage
lien
subpoena
citation
summon
conjure
enact
institute
institution
institutionalized
dandy
dandified
fop
foppish
miser
skinflint
niggard
screw
curmudgeon
skimp
stint
begrudge
grudge
parsimonious
chary
mean
stingy
miserly
tightfisted
niggardly
scotch
penurious
skimpy
husband
frugal
sparing
thrifty
economical
provident
abstemious
abstinent
continent
sober
moderate
temperate
intemperate
temperance
teetotalism
teetotal
generous
munificent
liberal
liberality
largess(e)
forbear
tolerate
stomach
brook
bequeath
legate
devise
bequest
legacy
patrimony
remnant
remainder
relic
relict
residue
vestige
vestigial
executioner
executive
executor
testament
testator
heir
heiress
heirloom
genealogy
ancestry
forbear
ancestor
antecedent
predecessor
descendent
scion
seedling
posterity
offspring
progeny
filial
filial piety
umbrella
awning
canopy
overshadow
cloudburst
deluge
deluvial
teem
drizzle
drizzly
rainfall
droplet
trickle
torrent
soil
mud
snow
slush
snowdrift
sleet
precipitation
precipitate
sediment
expedite
accelerate
foot-dragging
cast
fling
hurl
catalyze
overpowering
overwhelming
landslide
avalanche
mountain
mountainous
range
ridge
dorsal
caravan
armada
ensign
pennant
penultimate
array
formation
battalion
campaign
bugle
postwar
gust
paroxysm
erupt
blast
gale
whiff
implode
collapse
glare
glower
stare
gaze
gazelle
leer
look askance
squint
peep
glance
gloat
simper
grin
smirk
smug
dimple
cheek
chin
descry
espy
ogle
gusty
gush
spate
gusher
stream
trickle
effusive
overdose
prescription
exorbitant
excessive
overdone
overabundant
undue
prohibitive
superfluous
redundant
tautotlogical
superficial
supercilious
superiority
inordinate
dissolute
licentious
wanton
rakish
raffish
meretrix
bawd
bawdy
indecent
obscene
lascivious
lecherous
indulge
abandon
connive
collude
humor
libertine
indulgent
sybaritic
voluptuous
luxuriate
debauch
debauchery
depravity
backslide
decadence
decline
retrogress
regress
recede
backslide
forfeit
progress
headway
forge
progressive
regressive
retrograde
retrospective
anticipatory
introspect
retrospect
retrace
inspect
squander
lavish
waste
splurge
dissipate
prodigal
profligate
lavish
profuse
extravagant
sumptuous
luxurious
plush
magnificent
splendid
spectacular
imposing
majestic
superb
grandeur
spelendor
magnificence
epic
belle
beautiful
comely
taking
dainty
personable
grandiose
palatial
palace
hovel
hut
thatch
spendthrift
wastrel
martinet
disciplinarian
ascetic
stoic
self-denial
self-depreciate
debase
abase
downplay
derogate
eclipse
halo
corona
abate
relent
vitiate
impair
stultify
sap
damp
deaden
demean
degrade
demote
promote
self-absorbed
narcissist
hedonist
sybarite
voluptuary
indulgent
remorse
regret
compunction
regretful
remorseful
penitent
repentant
conpunctious
rueful
contrite
remorseless
confess
profess
confide
apologize
grateful
gratulant
felicitate
empty-handed
gratitude
honorarium
certificate
testimonial
tribute
trophy
conquest
loot
link
connect
merge
yoke
bond
conjoin
couple
mesh
nexus
liaison
liana
solder
weld
meld
fuse
cement
suture
sew
stitch
splice
congruity
conformity
uniformity
solidarity
norm
fissile
fissure
dent
rent
rift
breach
cleft
crevice
crevasse
hiatus
disconnectedness
interstice
fault
stratum/strata
stratify
seismic
seismograph
seismology
channel
canal
arroyo
trench
moat
furrow
gutter
sewer
ditch
gully
canyon
gorge
ravine
glen
defile
landlocked
valley
laceration
gape
schism
cleavage
disjunction
dissociation
fission
accord
accordance
nexus
congruent
congruous
coherent
correspondent
unanimous
consonant
vowel
jibe
tally
square
consort
homogenize
accommodate
accommodating
lodge
incongruous
incongruent
apophasis
oxymoron
paradox
contradictory
specious
paradoxical
coherence
cohesion
cohesive
disjointed
discrete
overlap
chaotic
bigot
diehard
concede
concession
budge
jolt
jerk
jerky
dart
sprint
hie
obstinate
obdurate
mulish
stubborn
tenacious
unyielding
close-minded
headstrong
dogged
opinionated
willful
recalcitrant
balky
perverse
pertinacious
inexorable
persevering
persevere
perseverance
compromise
contumacious
disobedient
rebellious
mutinous
insurgent
disloyal
faithless
perfidious
treacherous
trothless
loyal
faithful
fidelity
fealty
loyalty
faithfulness
trustworthiness
allegiance
patriotic
compatriot
chauvinist
jingoist
warmonger
dove
martyr
treason
quisle
apostasy
defection
perfidy
treachery
faithlessness
disloyalty
betray
double-cross
defect
desert
deserter
apostate
traditor
renegade
renege
recreant
insurgent
mutineer
quisling
turncoat
traitor
collaborator
ingrate
ingratitude
confront
confrontation
confrontational
rebel
defy
mutiny
counteract
boycott
revolt
insurrection
crusade
cruciform
antiestablishment
repel
repulse
subject to
yield to
succumb to
submit
surrender
capitulate
recapitulate
schematize
acquiesce
extradition
devolve
cede
inalienable
insubordinate
intransigent
inexorable
irrefutable
indubitable
indelible
inexpurgable
inexpungible
incorrigible
unexceptionable
ineffable
inexpressible
inexplicable
incorruptible
implacable
impracticable
indemonstrable
inviolable
ineradicable
unflappable
self-assured
unique
pertinacious
refractory
restive
obstreperous
fractious
unruly
conservative
hidebound
reactionary
untenable
unjustisfiable
defend
bulwark
rampart
fort
fastness
stronghold
fosse
drawbridge
gangway
gangplank
plank
masonry
mason
bricklayer
buttress
strut
sustain
prop (up)
anchor
brace
bracket
stilt
bracelet
truss
pillar
stake
guy
ballast
bilge
purchase
chassis
tire
tyre
spoke
hub
axle
coaxal
flange
fender
bulge
contour
outline
profile
configuration
skeleton
circumference
perimeter
periphery
girth
border
range
scope
compass
span
spell
periscope
levee
embankment
cordon
verge
fringe
brim
brink
pylon
beacon
chandelier
chandler
siren
pulley
tackle
address
dispose
disposal
disposable
hoist
elevate
uplift
uplifting
armor
helmet
ironclad
matchless
peerless
incomparable
bumptious
supercilious
pompous
vainglorious
assuming
ostentatious
imperious
pretentious
overbearing
complacent
smug
contumelious
hauteur
hubris
conceit
contumely
vanity
vain
swagger
condescending
condescend
deign
perquisite
subsidy
auspices
auspice
patron
customer
clientele
patronage
patronize
peremptory
masterful
humility
humble
modest
self-effacing
coy
frivolous
flippant
light-minded
giddy
flighty
levity
solemn
somber
sober
serious
grave
staid
solemnity
gravity
sobreity
ruthless
relentless
inclement
pitiless
tempestuous
stormy
turbulent
riotous
eddy
whirlpool
swirl
maelstrom
torrent
rapids
storm
blizzard
tempest
cyclone
dextrorotation
graceful
bucolic
rustic
pastoral
idyllic
compliant
pliant
obesiant
submissive
amenable
resigned
servile
slavish
reptilian
reptant
grovel
crouch
stoop
servant
serf
minion
dependent
slavery
lord
thrall
enslave
manumit
manumission
abolitionist
servitude
bondage
complaisance
meek
mild
gentle
genial
pacific
tender
balmy
clement
even-minded
even-tempered
equable
lenient
lenitive
lento
placid
merciful
beneficent
benevolent
benignant
mercy
benevolence
benediction
philanthropist
benefactor
beneficiary
eleemosynary
charitable
misanthrope
xenophobe
clan
clannish
diplomacy
diplomat
anthropic
docile
tractable
tame
strict
draconian
harsh
tight
stern
rigid
rigiorous
constricted
exacting
demanding
rigor
ordeal
drastic
stringent
astringent
styptic
puckery
pucker
pout
squint
contract
constrict
compress
convulse
convulsion
cramp
cramp
saturnine
leaden
somber
sullen
sulky
surly
morose
dour
dismal
dyspeptic
grouchy
truculent
fierce
ferocious
cruel
fell
ruffian
bestial
beastlike
atrocious
aweful
abysmal
egregious
fiendish
curmudgeon
enormity
atrocity
outrage
outrageous
savage
barbaric
barbarous
barbarize
feral
wild
civilize
surly
churlish
anger
ire
rage
fury
bile
umbrage
tantrum
rampage
pique
angry
furious
fuming
raging
irate
wrathful
resentful
huffy
irascible
irritable
inflammable
waspish
peevish
snappish
pettish
petulant
prickly
bristly
biliary
bilious
testy
touchy
huffy
grumpy
peppery
splenetic
spleenish
spleenful
choleric
crabbed
ratty
fiery
fractious
fretful
apoplectic
apoplexy
ticklish
tickle
tickler
fidgety
jittery
flustered
distraught
distracted
distressed
diverted
fidget
perturb
disquiet
discompose
rattle
rattlesnake
fluster
discombobulate
discomfit
disconcert
discommode
incommode
faze
abash
embarrass
humiliate
bristle
dander
offend
euphemism
circumlocution
connote
connotation
denotation
externalize
vexation
disquietude
tension
misgiving
qualm
chagrin
grimace
transfigure
apposite
pertinent
appropriate
apropos
suitable
apt
befitting
meet
due
advisable
felicitous
opportune
germane
relevant
seasonable
sufficient
adequate
pertain
contretemps
eligible
entitled
licit
illicit
illigitimate
unlawful
illegal
malfeasance
malpractice
extraneous
extrinsic
irrelevant
inappropriate
immaterial
immanent
palpitate
throb
pulse
palpate
palpable
tangible
perceptible
tactile
tactometer
manifest
clear
clear-cut
distinct
perspicuous
explicit
fathomable
comprehensible
intelligible
self-explanatory
self-evident
axiomatic
truism
ostensible
obvious
conspicuous
evident
striking
marked
pronounced
appreciable
signal
salient
prominent
legendary
trenchant
patent
blatant
obtrusive
pellucid
lucid
limpid
liquid
transparent
diaphanous
translucent
translucence
opalescence
opaque
subtle
nuance
subtlety
nicety
trivial
paltry
trashy
nugatory
trashy
piddling
petty
trifle
inferior
base
shoddy
sleazy
peripheral
factotum
handyman
temp
minutiae
particular
specifics
gist
crux
main point
vital feature
crucial point
watershed
floodgate
sluice
underscore
brand
blur
ambiguous
indistinct
equivocal
nebulous
vague
hazy
muddy
misty
murky
obscure
anonymous
anonym
pseudonym
alias
assumed name
pseudoscience
gloomy
dingy
dull
dim
faint
zoning
municipal
municipality
metropolis
cosmopolis
purlieus
outskirts
environs
proximity
proximate
locale
locality
locus
collocate
realign
recombine
recombinant
juxtaposition
abreast
side by side
proximal
appose
juxtapose
approach
adjacent
adjoining
neighboring
contiguous
coterminous
abut
accost
literacy
illiteracy
illiterate
uneducated
literal
literary
literate
literatus/literati
figurative
metaphoric
liken
compare to
allusion
metaphor
hint
cue
inkling
innuendo
insinuate
adumbrate
connote
intimate
insinuation
designate
earmark
signify
blacksmith
forger
silversmith
foundry
forge
smithy
ferrum
ferroconcrete
ferrous
verdigris
patina
tarnish
rust
oxidize
alloy
adulterate
jumble
anneal
temper
forge
knead
malleable
resilient
dregs
draff
dross
filings
shaving
sawdust
crumb
splinter
effulgence
irradiance
luster
lustre
sheen
beam
gloss (over)
glossal
glossography
effulgent
refulgent
resplendent
luminous
luminant
radiant
bright
glaring
glossy
shiny
lustrous
lackluster
sand
plane
burnish
scour
scrub
varnish
glaze
wax
vitrify
beset
stud
clay
crockery
earthenware
porcelain
pottery
ceramic
earthen
bravura
sprakle
twinkle
flicker
glimmer
glare
flare
blaze
blare
glisten
fulgurate
scintillate
scintilla
spark
glow
glowing
oblique
indirect
backhanded
labyrinth
maze
labyrinthine
circumlocutory
byzantine
tortuous
circuitous
serpentine
sinuous
itinerant
peripatetic
itinerary
cruise
odometer
odyssey
peregrination
sedentary
direct
straightforward
firsthand
outright
forthright
outspoken
barefaced
aboveboard
overt
candid
frank
hospitable
secretive
personal
substitutionary
vicarious
delegate
delegation
deputy
sheriff
agent
surrogate
proctor
understudy
subrogate
supersede
supplant
displace
emissary
plagiarism
garner
barn
hoard
cache
hide
secrete
conceal
evince
snitch
divulge
transpire
debunk
reveal
disclose
shadow
stalk
smuggle
spy
eavesdrop
wiretap
conspire
plot
cabal
steal
pilfer
sneak
snitch
espionage
furtive
clandestine
sneaky(sneaking)
slinky
surreptitious
stealthy
secret
closet
covert
underhanded
shadowy
stowaway
grapevine
riddle
conundrum
pun
enigma
enigmatic
decipher
cipher
nil
nonentity
entity
hieroglyph
hieroglyphic
pictograph
occult
cryptic
mysterious
mystic
uncanny
runic
hermetic
esoteric
inscrutable
recondite
abstruse
arcane
elliptical
arcanum
nostrum
panacea
legible
scrutable
accessbile
adroit
deft
dexterous
adept
proficient
versed
conversant
masterful
ambidextrous
consummate
finesse
gimmick
strategy
stratagem
ploy
tact
tactic
knack
expertise
know-how
colossal
enormous
tremendous
titantic
gigantic
gargantuan
massive
mammoth
mastodon
monumental
monolithic
mountainous
formidable
herculean
prodigious
marvelous
phenomenal
amazing
fabulous
gorgeous
stunning
miraculous
wonder
miracle
marvel
prodigy
nostalgia
homesick
lament
mourn
condolence
deplore
sign
moan
groan
jeremiad
sympathy
compassion
pitiful
sad
dolorous
doleful
woeful
mournful
sorrowful
plaintive
disconsolate
lachrymose
lachrymal
lachrymator
lugubrious
melancholy
dismal
grievous
harrowing
abject
miserable
poor
wretched
abysmal
sentimental
maudlin
mawkish
sentiment
torture
torment
agonize
aggrieve
afflict
excruciate
harrow
smart
